Tekla Open API Reference for Tekla Structures 2025
PolycurveGeometryBuilder.GetPolycurve Method
 Gets the final geometry after all the modifications made by the builder
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Polycurve GetPolycurve()
Public Function GetPolycurve As Polycurve
Return Value
Type: Polycurve
The final geometry list
See Also
Reference
PolycurveGeometryBuilder Class
Tekla.Structures.Geometry3d Namespace